BrunoRicci/DataloggerDHT22/Firmware/code_esp8266_dht22/src/main.cpp
    wifiTurnOff();
    return sent_packets_amount;
  }
  else{
    Serial.print("\nConnection timeout.");
    wifiTurnOff();
    return 0;
    //Connection failed.
  }

  // while((millis(- ))< config_globals.timeout && retries){
  // }


  /* //If won't exceed the maximum and the amount is not 0...
  if( start_packet+packets < rtcmem.rwVariables().archive_saved_pointer){
    
    StateMachine conn_machine(1);
    bool sendpackets=true;
    bool isconnected=false;

    WiFiClient client;
    HTTPClient http;
    uint8_t buf[sizeof(Measurement)*MAX_PACKET_PER_REQUEST];
    uint16_t sent_packets_amount=0;
    //Generate full URL.
    String url = "http://"+(String)config_globals.server_ip+":"+(String)config_globals.server_port;
    url+=SEND_MEASUREMENTS_URL;
    Serial.print("\n url: ");   Serial.println(url);

    while(sendpackets){

      if (conn_machine.getState() == 1){    //Network connection...
        if(conn_machine.stateInit()){
          sendpackets = true;
          wifiTurnOn();                     //Turn wifi on.
          Serial.setDebugOutput(true);  //DEBUG
          WiFiMulti.addAP(config_globals.server_ap_ssid, config_globals.server_ap_pass);  //Connects to WiFi network.
          connection_start_time=millis();               //Start counting for network connection timeout.
          Serial.print("\nConnecting to network...\n ");
        }

        if( (millis() - connection_start_time) < config_globals.connection_timeout ){  //If not timed out...
          if ((WiFiMulti.run() == WL_CONNECTED)){   //Checks if connection successful.
            Serial.printf("\nWiFi Connected!");
            isconnected=true; //Toggle flag.
            conn_machine.setState(2);   //Goes to server connection.
          }
        }
        else{
          //Notice timeout
          Serial.print("\n Unable to connect to network. data not sent.");
          sendpackets = false;  //break loop.
        }
        
        
      }
      else if (conn_machine.getState() == 2){ //Server connection...
        if(conn_machine.stateInit()){
          Serial.print("\nConnecting to server...\n");
          server_start_time = millis();      //Start counting for request timeout...
        }
          //here's the problem.
        if( (millis() - server_start_time) < config_globals.response_timeout ){  //If server connection doesn't timeout...
          if (http.begin(client, url)){
            conn_machine.setState(3);     //Goes to send packets state...
          }
          else{
            Serial.print(".");
            delay(10);
          }
        }
        else{
          //Notice timeout
          Serial.print("\n Unable to find server. data not sent.");
          sendpackets = false;  //break loop.
        }
      }
      else if (conn_machine.getState() == 3){ //Send packets.
        
        if(conn_machine.stateInit()){/////////////////////// PUT TIMEOUT HERE AS WELL, it gets stuck when server won't respond.
         
          request_start_time = millis();
          uint8_t request_retries = 0, connection_retries=0;
          uint16_t end_packet, i, n, pending_packets;

          if(packets == 0){ //Initialization of start and final packets index.
            start_packet = rtcmem.rwVariables().archive_sent_pointer; //The last sent packet following one.
            end_packet = rtcmem.rwVariables().archive_saved_pointer-1;    //The last saved packet into archive (maximum).
          }
          else{ 
            end_packet = start_packet + packets;
            if(end_packet > rtcmem.rwVariables().archive_saved_pointer-1)
              end_packet = rtcmem.rwVariables().archive_saved_pointer-1;
          }

          i = start_packet;
          n = MAX_PACKET_PER_REQUEST;
          if(i+n > end_packet){    //Limit the amount of packets to read if there are less than the maximum.
            n = end_packet-i; //Equals to pending packets.
          }

          //possibly the error is here... (in this while()).
          //Packets iteration is working fine, but when first request is sent and pointers ("i" and "n")
            are updated and the loop starts again, it's not entering to it.

            check the first condition: i+n < end_packet.
              In the last cycle (when n=0 as there is no pending packets)
              the condition will be false, as i-0 = i => i = end_packet -> false.

              -> The condition is wrong, it will never enter when i+n would happen to be equal to end_packet
              in the first cycle...

              in "logs 3.txt": it can be seen that in the last packet, the condition will be false, 
              as i=168 and n=12, i+n = 180 -> false.

           
          //While there are packets to be sent (n= number of packets)
          while(n > 0  && sendpackets){
            //TX
            //await response, continue iterating if OK, or retry if not (increment retry counter)
            // iteration: i+=n;  //"i" is now the last read packet +1.
            request_start_time=millis();
            Serial.printf("\nstart_packet=%d  /  end_packet=%d", start_packet, end_packet);
            Serial.printf("\nPacket iterator:\n i=%d  /  n=%d", i, n);

            archiveRead(buf, i, n); //Read "n" packets starting from packet number "i"

            String request = generatePOSTRequest(buf, n); //Generate request with n elements.
            Serial.print("[HTTP] POST...:\n");  Serial.print(request);
            
            
            //Must put a delay or a timeout await here. Server is taking a bit to respond.
            while(millis()-request_start_time < config_globals.response_timeout && request_retries < config_globals.connection_retry){ 
              //Try to send packets to server, will try until timeout or number of request_retries reach maximum.
              int httpCode = http.POST( request );    //Send POST request.
              Serial.printf("\n[HTTP] POST sent... response code: %d\n", httpCode);  //HTTP response...

              if (httpCode > 0){  //If > 0, the server got the request and is sending this response code.
                
