BrunoRicci/DataloggerDHT22/Firmware/code_esp8266_dht22/src/main.cpp
                if (httpCode == HTTP_CODE_OK || httpCode == HTTP_CODE_MOVED_PERMANENTLY){
                  request_start_time=millis();    //Reset time counter.
                  request_retries=0;                      //Reset request_retries counter.

                  String payload = http.getString();  Serial.println(payload);
                  
                  sent_packets_amount += n;   //Increase counter.

                  i += n;  //"i" is now the last read packet.
                  n = MAX_PACKET_PER_REQUEST;
                  if(i+n > end_packet)    //Limit the amount of packets to read if there are less than the maximum.
                    n = end_packet-i; //equal n to que amount of pending packets.
                  
                  Serial.printf("\n      DATA SENT. Packets pending: %d", end_packet-i);
                  Serial.printf("\n  Packets in next request: %d", n);
                  Serial.printf("\n  i=%d  /  n=%d", i, n);
                }
                else{
                  request_retries++;
                  Serial.printf("[HTTP] POST failed, error: %s\n", http.errorToString(httpCode).c_str());
                }
              }
              else{

                  //  IT'S RETURNING CODE 11 -> TIMEOUT.
                
                  // HTTPC_ERROR_CONNECTION_REFUSED  (-1)
                  // HTTPC_ERROR_SEND_HEADER_FAILED  (-2)
                  // HTTPC_ERROR_SEND_PAYLOAD_FAILED (-3)
                  // HTTPC_ERROR_NOT_CONNECTED       (-4)
                  // HTTPC_ERROR_CONNECTION_LOST     (-5)
                  // HTTPC_ERROR_NO_STREAM           (-6)
                  // HTTPC_ERROR_NO_HTTP_SERVER      (-7)
                  // HTTPC_ERROR_TOO_LESS_RAM        (-8)
                  // HTTPC_ERROR_ENCODING            (-9)
                  // HTTPC_ERROR_STREAM_WRITE        (-10)
                  // HTTPC_ERROR_READ_TIMEOUT        (-11)
               
                //TEST CONNECTION!
                request_retries++;
                Serial.printf("\n Response not OK. code: %d\n isConnected():%d  /  http.connected():%d  / retries:%d", 
                                                  httpCode,   WiFi.isConnected(),   http.connected(),     request_retries );
                
                }
              if(request_retries >= config_globals.connection_retry)  //If maximum retries reached...
                sendpackets = false;  //Stop sending packets.
              yield();
            }
          }
          sendpackets = false;

          http.end(); //ends HTTP client.
        }
      }
      yield();  //yield in every loop...
    }
    wifiTurnOff();  //Turn wifi off after sending all the packets.
    return sent_packets_amount;
  } 
  else{
    wifiTurnOff();
    return 0;
  }
  
  // Serial.printf("\n Time taken: %dms.", (int)(millis() - start_time)); */
}

uint32_t getServerTimeUnix(void){
  //Cnnects to server, sends a request and returns unix time in UTC from server.
  return 0;
}

int32_t generateMeasurementValue(unsigned char type, float value){
  int32_t measurement=0; 

  if (type == TEMPERATURE){
     // -200 ~ 800 -> -20ºC to 80ºC
     measurement = (int16_t)(value*10);
  }
  else if (type == HUMIDITY)
  { // 0 ~ 100 ->  0% to 100%
    measurement = (uint8_t)(value);
  }
  return(measurement);
}

String formatMeasurementValue(unsigned char type, float value){  //Converts measurements into valid format
  char measurement [10];  //4B string array for the value.
  measurement[(sizeof(measurement)-1)] = 0; //Put NULL character at the end of the string.

  if (type == TEMPERATURE){
     // -200 ~ 800 -> -20ºC to 80ºC
     itoa((signed short int)(value * 10), measurement, 10);   //Takes the first digit after comma.
  }
  else if (type == HUMIDITY)
  { // 0 ~ 100 ->  0% to 100%
    itoa((unsigned char)(value), measurement, 10);    //Takes only integer part.
  }

  measurement[(sizeof(measurement)-1)] = 0; //Put NULL character at the end of the string
  Serial.printf("\n\nMeasurement:");
  Serial.printf(measurement);
  return( String(measurement) );
}

void* stringToArray(std::string origin_string){
    //This function should return -1 if the size of "a" (destination array) is smaller than "s"
    //to avoid buffer overflow and possible fragmentation faults...
    int string_length = (origin_string.length()) + 1 ;

    char* s = (char*) malloc(string_length);
    strcpy(s, origin_string.c_str());

    return (s);
}

void goDeepSleep(uint64_t time){
  if(time > 3600000000 ) time = 3600000000;  //Maximum 1h (3600 sec).
  
  uint32_t t = time/1000000;
 
  rtcmem.setElapsedTime(t+(millis()/1000));

  Serial.printf("\nGoing deep sleep for %d seconds... ", (t));

  ESP.deepSleep(time, WAKE_RF_DISABLED);  //deep sleeps for 5 seconds...
}

void setSensorPower(unsigned char state){
  if (state == ON)
  {
    digitalWrite(PWR_SENSORS_PIN, LOW);  //Turn sensors supply on.
    // Serial.printf("\nSensors turned on.");
  }
  if (state == OFF)
  {
    digitalWrite(PWR_SENSORS_PIN, HIGH);  //Turn sensors supply off.
    // Serial.printf("\nSensors turned off.");
  }
}

void wifiTurnOff(void){
  WiFi.disconnect(true);  //Turns off wifi module, so in the wake up it won't turn on automatically until required.
  WiFi.mode( WIFI_OFF );  //Wifi starts turned off after wake up, in order to save energy.
  delay(1);
  WiFi.forceSleepBegin(); 
  delay(1);
}

void wifiTurnOn(void){
  WiFi.forceSleepWake();    //Turns on radio.
  delay(1);   //Necessary delay to settle.
  WiFi.mode(WIFI_STA);  // Bring up the WiFi connection.
  WiFi.persistent(false); //Wifi credentials loaded directly from flash (as specified below) and not overwritten to it.
}

bool initglobals(void){
  /*  Read configuration file (JSON) and load data into Config_globals struct. 
  First load all the data from file into a string, and then parse it to a Json buffer,
  to then extract the values from each keyword.
  If file not found, load default values, defined in this function.
  */

  void* p = &config_globals;
  uint8_t buf[sizeof(Config_globals)]; //temporary buffer.

